routes/web.php

select * from `payments` where date(`created_at`) = '2018-08-20 00:00:00'
select * from `transfers` where date(`created_at`) = '2018-08-20 00:00:00'
---

Route::get('payments/history', 'PaymentController@history')->name('payments.history');
Route::post('payments/history', 'PaymentController@handleHistory')->name('payments.history');
Route::get('payments/history/{from}/{to}', 'PaymentController@search')->name('payments.search');
Route::resource('payments', 'PaymentController');

Route::get('transfers/history', 'TransferController@history')->name('transfers.history');