app/Http/Controllers/MerchantController.php

    public function index()
    {
        $merchants = Merchant::paginate(10);
---
select * from `merchants` limit 10 offset 10
select count(*) as aggregate from `merchants`